johnrosshunt/pocket-tank/firmware/sdkconfig.defaults
# pocket-tank — ESP32-S3R8, 8 MB octal PSRAM, 16 MB flash
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
# PSRAM: octal, 80 MHz, available to malloc; memtest off to save boot time
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=8192
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=65536
CONFIG_SPIRAM_ALLOW_STACK_EXTERNAL_MEMORY=y
CONFIG_SPIRAM_MEMTEST=n
# flash: octal-capable board; QIO fast; mmap'd model partition read through cache
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
# no radio at runtime
CONFIG_ESP_WIFI_ENABLED=n
CONFIG_BT_ENABLED=n
# generous main stack for the tank/render task; inference has its own task
CONFIG_ESP_MAIN_TASK_STACK_SIZE=16384
CONFIG_FREERTOS_HZ=1000
CONFIG_ESP_TASK_WDT_TIMEOUT_S=30
CONFIG_COMPILER_OPTIMIZATION_PERF=y

# real board: AMOLED + touch
CONFIG_POCKET_TANK_DISPLAY_CO5300=y
CONFIG_POCKET_TANK_TOUCH_CST9217=y
CONFIG_POCKET_TANK_AUDIO_ES8311=y
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU1=n
CONFIG_ESP32S3_DATA_CACHE_64KB=y
CONFIG_ESP32S3_DATA_CACHE_LINE_64B=y
